c8220(ivy)_not_consolidated_4core_4iothread/multiplier_2/run10.txt
# run=10/10
# 2026-04-02T21:42:29-06:00
# cmd: taskset -c 1-39 sysbench oltp_read_write --mysql-db=sbtest --tables=1 --table_size=100 --threads=32 --time=60 --rand-type=pareto run

sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 32
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            15414
        write:                           3932
        other:                           2032
        total:                           21378
    transactions:                        931    (14.99 per sec.)
    queries:                             21378  (344.16 per sec.)
    ignored errors:                      170    (2.74 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      14.9881
    time elapsed:                        62.1161s
    total number of events:              931

Latency (ms):
         min:                                   63.49
         avg:                                 2100.49
         max:                                11095.43
         95th percentile:                     4599.99
         sum:                              1955557.23

Threads fairness:
    events (avg/stddev):           29.0938/2.93
    execution time (avg/stddev):   61.1112/0.64